# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
# your code here
temp = pd.read_csv("temp_states.csv")

#### Print `temp`.

In [4]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [5]:
# your code here
temp.describe()

       Temperature
count     7.000000
mean     15.158730
std       6.695265
min       3.333333
25%      11.944444
50%      17.222222
75%      19.722222
max      22.222222

In [6]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
City           7 non-null object
State          7 non-null object
Temperature    7 non-null float64
dtypes: float64(1), object(2)
memory usage: 248.0+ bytes

In [7]:
"""
Objects and float
"""

'\nObjects and float\n'

#### Select the rows where state is New York.

In [10]:
# your code here
temp_NY = temp.loc[temp.State == "New York"]
temp_NY

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [11]:
# your code here
temp_NY.mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [24]:
# your code here
temp_15 = temp.loc[temp.Temperature >= 15]

cities = list(temp_15["City"].unique())
states = list(temp_15["State"].unique())
cities
states

'\ncities = list(temp_15["City"].unique())\nstates = list(temp_15["State"].unique())\ncities\nstates\n'

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [22]:
# your code here
cities

['NYC', 'Hartford', 'Treton', 'Newark']

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [28]:
# your code here
temp_15.head()
temp_15_20 = temp_15.loc[temp_15.Temperature <= 20]
temp_15_20.head()

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
6    Newark   New Jersey    20.000000

#### Find the mean and standard deviation of the temperature of each state.

In [34]:
# your code here
states = list(temp["State"].unique())
for state in states:
    temp_state = temp.loc[temp.State == state]
    print(state, temp_state.std()[0])

New York 8.133404168888033
Connecticut 1.9641855032959799
New Jersey 1.5713484026367568

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [131]:
# your code here
employees = pd.read_csv("employees.csv")
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Explore the data types of the `employees` dataframe. Comment your results.

In [132]:
# your code here
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
Name          9 non-null object
Department    9 non-null object
Education     9 non-null object
Gender        9 non-null object
Title         9 non-null object
Years         9 non-null int64
Salary        9 non-null int64
dtypes: int64(2), object(5)
memory usage: 584.0+ bytes

In [133]:
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

In [134]:
"""
Objects and int
"""

'\nObjects and int\n'

#### What's the average salary in this company?

In [135]:
# your code here
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [136]:
# your code here
max_sal = employees["Salary"].max()
max_sal

70

#### What's the lowest salary?

In [137]:
# your code here
min_sal = employees["Salary"].min()
min_sal

30

#### Who are the employees with the lowest salary?

In [138]:
# your code here
lowest_emp = employees.loc[employees["Salary"] == min_sal]
lowest_emp

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [139]:
# your code here
david = employees.loc[employees["Name"] == "David"]
david

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [140]:
# your code here
david["Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [141]:
# your code here
asso = employees.loc[employees["Title"] == "associate"]
asso

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [142]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [143]:
# Method 2
# your code here
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [144]:
# Method 3
# your code here
employees.loc[:2]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [145]:
# your code here
asso_55 = asso.loc[asso["Salary"] > 55]
asso_55

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [164]:
# your code here
group = employees.groupby(['Years']).mean()
group

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [163]:
# your code here
group = employees.groupby(['Title']).mean()
group

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [167]:
# your code here
res = employees['Salary'].quantile([.25, .5, 0.75])
res

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [158]:
# your code here
type
gen_M = employees.loc[employees["Gender"] == "M"]
gen_F = employees.loc[employees["Gender"] == "F"]
print(gen_M["Salary"].mean())
print(gen_F["Salary"].mean())

50.0
47.5

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [171]:
# your code here
employees['Years'].describe()

count    9.000000
mean     4.111111
std      2.803767
min      1.000000
25%      2.000000
50%      3.000000
75%      7.000000
max      8.000000
Name: Years, dtype: float64

In [172]:
employees['Salary'].describe()

count     9.000000
mean     48.888889
std      16.541194
min      30.000000
25%      35.000000
50%      55.000000
75%      60.000000
max      70.000000
Name: Salary, dtype: float64

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [173]:
# your code here
orders = pd.read_csv("orders.csv")
orders.head()

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [175]:
# your code here
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
index           1000 non-null int64
InvoiceNo       1000 non-null int64
StockCode       1000 non-null object
year            1000 non-null int64
month           1000 non-null int64
day             1000 non-null int64
hour            1000 non-null int64
Description     1000 non-null object
Quantity        1000 non-null int64
InvoiceDate     1000 non-null object
UnitPrice       1000 non-null float64
CustomerID      1000 non-null int64
Country         1000 non-null object
amount_spent    1000 non-null float64
dtypes: float64(2), int64(8), object(4)
memory usage: 109.5+ KB

####  What is the average purchase price?

In [176]:
# your code here
orders["amount_spent"].mean()

24.732800000000005

#### What are the highest and lowest purchase prices?

In [177]:
# your code here
orders["amount_spent"].min()

0.29

In [178]:
orders["amount_spent"].max()

1627.2

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [183]:
# your code here
print("There is no customer from Spain")
orders.loc[orders["Country"] == "Spain"]

There is no customer from Spain

Empty DataFrame
Columns: [index, InvoiceNo, StockCode, year, month, day, hour, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country, amount_spent]
Index: []

In [184]:
orders.loc[orders["Country"] == "France"]

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26,26,536370,22728,2010,12,3,8,alarm clock bakelike pink,24,2010-12-01 08:45:00,3.75,12583,France,90.00
27,27,536370,22727,2010,12,3,8,alarm clock bakelike red,24,2010-12-01 08:45:00,3.75,12583,France,90.00
28,28,536370,22726,2010,12,3,8,alarm clock bakelike green,12,2010-12-01 08:45:00,3.75,12583,France,45.00
29,29,536370,21724,2010,12,3,8,panda and bunnies sticker sheet,12,2010-12-01 08:45:00,0.85,12583,France,10.20
30,30,536370,21883,2010,12,3,8,stars gift tape,24,2010-12-01 08:45:00,0.65,12583,France,15.60
31,31,536370,10002,2010,12,3,8,inflatable political globe,48,2010-12-01 08:45:00,0.85,12583,France,40.80
32,32,536370,21791,2010,12,3,8,vintage heads and tails card game,24,2010-12-01 08:45:00,1.25,12583,France,30.00
33,33,536370,21035,2010,12,3,8,set/2 red retrospot tea towels,18,2010-12-01 08:45:00,2.95,12583,France,53.10
34,34,536370,22326,2010,12,3,8,round snack boxes set of4 woodland,24,2010-12-01 08:45:00,2.95,12583,France,70.80
35,35,536370,22629,2010,12,3,8,spaceboy lunch box,24,2010-12-01 08:45:00,1.95,12583,France,46.80
36,36,536370,22659,2010,12,3,8,lunch box i love london,24,2010-12-01 08:45:00,1.95,12583,France,46.80
37,37,536370,22631,2010,12,3,8,circus parade lunch box,24,2010-12-01 08:45:00,1.95,12583,France,46.80
38,38,536370,22661,2010,12,3,8,charlotte bag dolly girl design,20,2010-12-01 08:45:00,0.85,12583,France,17.00
39,39,536370,21731,2010,12,3,8,red toadstool led night light,24,2010-12-01 08:45:00,1.65,12583,France,39.60
40,40,536370,22900,2010,12,3,8,set 2 tea towels i love london,24,2010-12-01 08:45:00,2.95,12583,France,70.80
41,41,536370,21913,2010,12,3,8,vintage seaside jigsaw puzzles,12,2010-12-01 08:45:00,3.75,12583,France,45.00
42,42,536370,22540,2010,12,3,8,mini jigsaw circus parade,24,2010-12-01 08:45:00,0.42,12583,France,10.08
43,43,536370,22544,2010,12,3,8,mini jigsaw spaceboy,24,2010-12-01 08:45:00,0.42,12583,France,10.08
44,44,536370,22492,2010,12,3,8,mini paint set vintage,36,2010-12-01 08:45:00,0.65,12583,France,23.40
45,45,536370,POST,2010,12,3,8,postage,3,2010-12-01 08:45:00,18.00,12583,France,54.00

#### How many customers do we have in Spain?

In [185]:
# your code here
len(orders.loc[orders["Country"] == "Spain"])

0

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [194]:
# your code here
orders.loc[orders["UnitPrice"] == orders["UnitPrice"].min()]

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
217,217,536390,20668,2010,12,3,10,disco ball christmas decoration,288,2010-12-01 10:19:00,0.1,17511,United Kingdom,28.8

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [204]:
# your code here
def search_lunch(x):
    if x.find("lunch bag"):
        return True
    else:
        return False

lunch = orders.loc[orders["Description"].apply(lambda x:search_lunch(x))]
lunch

,index,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
5,5,536365,22752,2010,12,3,8,set 7 babushka nesting boxes,2,2010-12-01 08:26:00,7.65,17850,United Kingdom,15.30
6,6,536365,21730,2010,12,3,8,glass star frosted t-light holder,6,2010-12-01 08:26:00,4.25,17850,United Kingdom,25.50
7,7,536366,22633,2010,12,3,8,hand warmer union jack,6,2010-12-01 08:28:00,1.85,17850,United Kingdom,11.10
8,8,536366,22632,2010,12,3,8,hand warmer red polka dot,6,2010-12-01 08:28:00,1.85,17850,United Kingdom,11.10
9,9,536367,84879,2010,12,3,8,assorted colour bird ornament,32,2010-12-01 08:34:00,1.69,13047,United Kingdom,54.08
10,10,536367,22745,2010,12,3,8,poppy s playhouse bedroom,6,2010-12-01 08:34:00,2.10,13047,United Kingdom,12.60
11,11,536367,22748,2010,12,3,8,poppy s playhouse kitchen,6,2010-12-01 08:34:00,2.10,13047,United Kingdom,12.60
12,12,536367,22749,2010,12,3,8,feltcraft princess charlotte doll,8,2010-12-01 08:34:00,3.75,13047,United Kingdom,30.00
13,13,536367,22310,2010,12,3,8,ivory knitted mug cosy,6,2010-12-01 08:34:00,1.65,13047,United Kingdom,9.90
14,14,536367,84969,2010,12,3,8,box of 6 assorted colour teaspoons,6,2010-12-01 08:34:00,4.25,13047,United Kingdom,25.50
15,15,536367,22623,2010,12,3,8,box of vintage jigsaw blocks,3,2010-12-01 08:34:00,4.95,13047,United Kingdom,14.85
16,16,536367,22622,2010,12,3,8,box of vintage alphabet blocks,2,2010-12-01 08:34:00,9.95,13047,United Kingdom,19.90
17,17,536367,21754,2010,12,3,8,home building block word,3,2010-12-01 08:34:00,5.95,13047,United Kingdom,17.85
18,18,536367,21755,2010,12,3,8,love building block word,3,2010-12-01 08:34:00,5.95,13047,United Kingdom,17.85
19,19,536367,21777,2010,12,3,8,recipe box with metal heart,4,2010-12-01 08:34:00,7.95,13047,United Kingdom,31.80
20,20,536367,48187,2010,12,3,8,doormat new england,4,2010-12-01 08:34:00,7.95,13047,United Kingdom,31.80
21,21,536368,22960,2010,12,3,8,jam making set with jars,6,2010-12-01 08:34:00,4.25,13047,United Kingdom,25.50
22,22,536368,22913,2010,12,3,8,red coat rack paris fashion,3,2010-12-01 08:34:00,4.95,13047,United Kingdom,14.85
23,23,536368,22912,2010,12,3,8,yellow coat rack paris fashion,3,2010-12-01 08:34:00,4.95,13047,United Kingdom,14.85
24,24,536368,22914,2010,12,3,8,blue coat rack paris fashion,3,2010-12-01 08:34:00,4.95,13047,United Kingdom,14.85
25,25,536369,21756,2010,12,3,8,bath building block word,3,2010-12-01 08:35:00,5.95,13047,United Kingdom,17.85
26,26,536370,22728,2010,12,3,8,alarm clock bakelike pink,24,2010-12-01 08:45:00,3.75,12583,France,90.00
27,27,536370,22727,2010,12,3,8,alarm clock bakelike red,24,2010-12-01 08:45:00,3.75,12583,France,90.00
28,28,536370,22726,2010,12,3,8,alarm clock bakelike green,12,2010-12-01 08:45:00,3.75,12583,France,45.00
29,29,536370,21724,2010,12,3,8,panda and bunnies sticker sheet,12,2010-12-01 08:45:00,0.85,12583,France,10.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
970,970,536520,21804,2010,12,3,12,white christmas garland stars trees,3,2010-12-01 12:43:00,3.75,14729,United Kingdom,11.25
971,971,536520,21584,2010,12,3,12,retrospot small tube matches,12,2010-12-01 12:43:00,1.65,14729,United Kingdom,19.80
972,972,536520,21588,2010,12,3,12,retrospot giant tube matches,3,2010-12-01 12:43:00,2.55,14729,United Kingdom,7.65
973,973,536520,22152,2010,12,3,12,place setting white star,12,2010-12-01 12:43:00,0.42,14729,United Kingdom,5.04
974,974,536520,22441,2010,12,3,12,grow your own basil in enamel mug,1,2010-12-01 12:43:00,2.10,14729,United Kingdom,2.10
975,975,536520,22955,2010,12,3,12,36 foil star cake cases,2,2010-12-01 12:43:00,2.10,14729,United Kingdom,4.20
976,976,536520,22956,2010,12,3,12,36 foil heart cake cases,2,2010-12-01 12:43:00,2.10,14729,United Kingdom,4.20
977,977,536520,22582,2010,12,3,12,pack of 6 sweetie gift boxes,2,2010-12-01 12:43:00,2.55,14729,United Kingdom,5.10
978,978,536520,22583,2010,12,3,12,pack of 6 handbag gift boxes,3,2010-12-01 12:43:00,2.55,14729,United Kingdom,7.65
979,979,536520,22241,2010,12,3,12,garland wooden happy easter,2,2010-12-01 12:43:00,1.25,14729,United Kingdom,2.50
980,980,536520,22904,2010,12,3,12,calendar paper cut design,3,2010-12-01 12:43:00,2.95,14729,United Kingdom,8.85
981,981,536520,22905,2010,12,3,12,calendar in season design,2,2010-12-01 12:43:00,2.95,14729,United Kingdom,5.90
982,982,536520,22197,2010,12,3,12,small popcorn holder,3,2010-12-01 12:43:00,0.85,14729,United Kingdom,2.55
983,983,536520,22092,2010,12,3,12,blue paisley tissue box,1,2010-12-01 12:43:00,1.25,14729,United Kingdom,1.25
984,984,536520,22469,2010,12,3,12,heart of wicker small,1,2010-12-01 12:43:00,1.65,14729,United Kingdom,1.65
985,985,536520,22100,2010,12,3,12,skulls square tissue box,1,2010-12-01 12:43:00,1.25,14729,United Kingdom,1.25
986,986,536520,22096,2010,12,3,12,pink paisley square tissue box,1,2010-12-01 12:43:00,1.25,14729,United Kingdom,1.25
987,987,536520,22583,2010,12,3,12,pack of 6 handbag gift boxes,1,2010-12-01 12:43:00,2.55,14729,United Kingdom,2.55
988,988,536520,21358,2010,12,3,12,toast its - happy birthday,2,2010-12-01 12:43:00,1.25,14729,United Kingdom,2.50
989,989,536520,21123,2010,12,3,12,set/10 ivory polkadot party candles,1,2010-12-01 12:43:00,1.25,14729,United Kingdom,1.25
990,990,536520,21124,2010,12,3,12,set/10 blue polkadot party candles,1,2010-12-01 12:43:00,1.25,14729,United Kingdom,1.25
991,991,536520,21122,2010,12,3,12,set/10 pink polkadot party candles,1,2010-12-01 12:43:00,1.25,14729,United Kingdom,1.25
992,992,536520,84378,2010,12,3,12,set of 3 heart cookie cutters,1,2010-12-01 12:43:00,1.25,14729,United Kingdom,1.25
993,993,536520,21985,2010,12,3,12,pack of 12 hearts design tissues,12,2010-12-01 12:43:00,0.29,14729,United Kingdom,3.48
994,994,536520,21427,2010,12,3,12,skulls storage box small,2,2010-12-01 12:43:00,2.10,14729,United Kingdom,4.20
995,995,536520,21034,2010,12,3,12,rex cash+carry jumbo shopper,2,2010-12-01 12:43:00,0.95,14729,United Kingdom,1.90
996,996,536520,21930,2010,12,3,12,jumbo storage bag skulls,1,2010-12-01 12:43:00,1.95,14729,United Kingdom,1.95
997,997,536520,20772,2010,12,3,12,garden path journal,1,2010-12-01 12:43:00,2.55,14729,United Kingdom,2.55
998,998,536520,22469,2010,12,3,12,heart of wicker small,2,2010-12-01 12:43:00,1.65,14729,United Kingdom,3.30
999,999,536520,71406C,2010,12,3,12,black orange squeezer,12,2010-12-01 12:43:00,0.42,14729,United Kingdom,5.04

In [203]:
sts = "lunch bag lkasd"
sts.find("lunch bag")

0

#### Select all `lunch bag` orders made in 2011.

In [198]:
# your code here
year_11 = orders.loc[orders["year"] == 2011]
year_11 = year_11.loc[year_11["Description"].contains("lunch bag")]

AttributeError: 'Series' object has no attribute 'contains'

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [188]:
# your code here
orders.groupby(['Country']).mean()

,index,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
Country,,,,,,,,,,
Australia,201.500000,536389.000000,2010.0,12.0,3.0,10.000000,7.642857,5.278571,12431.00000,25.589286
France,35.500000,536370.000000,2010.0,12.0,3.0,8.000000,22.450000,2.764500,12583.00000,42.793000
Netherlands,376.500000,536403.000000,2010.0,12.0,3.0,11.000000,48.500000,8.425000,12791.00000,96.300000
United Kingdom,513.709544,536423.576763,2010.0,12.0,3.0,10.840249,12.709544,2.967127,16127.88278,24.197189

#### What's the most expensive item?

In [191]:
# your code here
orders['UnitPrice'].max()

165.0

#### What is the average amount spent per year?

In [195]:
# your code here
years = orders.groupby(['year']).mean()
years

,index,InvoiceNo,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
year,,,,,,,,,
2010,499.5,536421.98,12.0,3.0,10.772,12.905,3.00635,15998.555,24.7328